Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTC/atdf/PIC32CX1025MTC128.atdf
        <module name="AESB" id="11145" version="G">
          <instance name="AESB">
            <register-group address-space="base" name="AESB" name-in-module="AESB" offset="0x44004000"/>
            <parameters>
              <param name="INSTANCE_ID" value="51"/>
              <param name="CLOCK_ID" value="51"/>
              <param name="INSTANCE_ID_AESBSEC" value="52"/>
            </parameters>
          </instance>
        </module>
        <module name="CHIPID" id="6417" version="ZW">
          <instance name="CHIPID">
            <register-group address-space="base" name="CHIPID" name-in-module="CHIPID" offset="0x40050200"/>
          </instance>
        </module>
        <module name="CMCC" id="11108" version="I">
          <instance name="CMCC0">
            <register-group address-space="base" name="CMCC0" name-in-module="CMCC" offset="0x46008000"/>
            <parameters>
              <param name="ICACHE_PRESENT" value="1"/>
              <param name="DCACHE_PRESENT" value="0"/>
              <param name="SIZE" value="16KB"/>
            </parameters>
          </instance>
          <instance name="CMCC1">
            <register-group address-space="base" name="CMCC1" name-in-module="CMCC" offset="0x4600C000"/>
            <parameters>
              <param name="ICACHE_PRESENT" value="0"/>
              <param name="DCACHE_PRESENT" value="1"/>
              <param name="SIZE" value="8KB"/>
            </parameters>
          </instance>
        </module>
        <module name="CPKCC" id="44163" version="B">
          <instance name="CPKCC">
            <register-group address-space="base" name="CPKCC" name-in-module="CPKCC" offset="0x46000000"/>
            <parameters>
              <param name="INSTANCE_ID" value="59"/>
              <param name="CLOCK_ID" value="59"/>
            </parameters>
          </instance>
        </module>
        <module name="DWDT" id="04686" version="C">
          <instance name="DWDT">
            <register-group address-space="base" name="DWDT" name-in-module="DWDT" offset="0x40052000"/>
            <parameters>
              <param name="INSTANCE_ID" value="4"/>
            </parameters>
          </instance>
        </module>
        <module name="FLEXCOM" id="11268" version="ZH">
          <instance name="FLEXCOM0">
            <register-group address-space="base" name="FLEXCOM0" name-in-module="FLEXCOM" offset="0x40000000"/>
            <parameters>
              <param name="INSTANCE_ID" value="9"/>
              <param name="CLOCK_ID" value="9"/>
              <param name="USART_FIFO_SIZE" value="8"/>
              <param name="SPI_FIFO_SIZE" value="8"/>
              <param name="TWI_FIFO_SIZE" value="8"/>
            </parameters>
            <signals>
              <signal pad="PA4" function="A" group="FLEXCOM0_IO" index="0"/>
              <signal pad="PA5" function="A" group="FLEXCOM0_IO" index="1"/>
              <signal pad="PA6" function="A" group="FLEXCOM0_IO" index="2"/>
              <signal pad="PA7" function="A" group="FLEXCOM0_IO" index="3"/>
              <signal pad="PA6" function="B" group="FLEXCOM0_IO" index="4"/>
              <signal pad="PA29" function="B" group="FLEXCOM0_IO" index="4"/>
            </signals>
          </instance>
          <instance name="FLEXCOM1">
            <register-group address-space="base" name="FLEXCOM1" name-in-module="FLEXCOM" offset="0x40004000"/>
            <parameters>
              <param name="INSTANCE_ID" value="10"/>
              <param name="CLOCK_ID" value="10"/>
              <param name="USART_FIFO_SIZE" value="8"/>
              <param name="SPI_FIFO_SIZE" value="8"/>
              <param name="TWI_FIFO_SIZE" value="8"/>
            </parameters>
            <signals>
              <signal pad="PA8" function="A" group="FLEXCOM1_IO" index="0"/>
              <signal pad="PC2" function="B" group="FLEXCOM1_IO" index="0"/>
              <signal pad="PA9" function="A" group="FLEXCOM1_IO" index="1"/>
              <signal pad="PC3" function="B" group="FLEXCOM1_IO" index="1"/>
              <signal pad="PA10" function="A" group="FLEXCOM1_IO" index="2"/>
              <signal pad="PA11" function="A" group="FLEXCOM1_IO" index="3"/>
              <signal pad="PA10" function="B" group="FLEXCOM1_IO" index="4"/>
              <signal pad="PA29" function="C" group="FLEXCOM1_IO" index="4"/>
            </signals>
          </instance>
          <instance name="FLEXCOM2">
            <register-group address-space="base" name="FLEXCOM2" name-in-module="FLEXCOM" offset="0x40008000"/>
            <parameters>
              <param name="INSTANCE_ID" value="11"/>
              <param name="CLOCK_ID" value="11"/>
              <param name="USART_FIFO_SIZE" value="8"/>
              <param name="SPI_FIFO_SIZE" value="8"/>
              <param name="TWI_FIFO_SIZE" value="8"/>
            </parameters>
            <signals>
              <signal pad="PA12" function="A" group="FLEXCOM2_IO" index="0"/>
              <signal pad="PA13" function="A" group="FLEXCOM2_IO" index="1"/>
              <signal pad="PA14" function="A" group="FLEXCOM2_IO" index="2"/>
              <signal pad="PA15" function="A" group="FLEXCOM2_IO" index="3"/>
              <signal pad="PA14" function="B" group="FLEXCOM2_IO" index="4"/>
              <signal pad="PA29" function="D" group="FLEXCOM2_IO" index="4"/>
            </signals>
          </instance>
          <instance name="FLEXCOM3">
            <register-group address-space="base" name="FLEXCOM3" name-in-module="FLEXCOM" offset="0x4000C000"/>
            <parameters>
              <param name="INSTANCE_ID" value="12"/>
              <param name="CLOCK_ID" value="12"/>
              <param name="USART_FIFO_SIZE" value="8"/>
              <param name="SPI_FIFO_SIZE" value="8"/>
              <param name="TWI_FIFO_SIZE" value="8"/>
            </parameters>
            <signals>
              <signal pad="PA16" function="A" group="FLEXCOM3_IO" index="0"/>
              <signal pad="PB9" function="B" group="FLEXCOM3_IO" index="0"/>
              <signal pad="PA17" function="A" group="FLEXCOM3_IO" index="1"/>
              <signal pad="PB10" function="B" group="FLEXCOM3_IO" index="1"/>
              <signal pad="PA18" function="A" group="FLEXCOM3_IO" index="2"/>
              <signal pad="PB11" function="B" group="FLEXCOM3_IO" index="2"/>
              <signal pad="PA19" function="A" group="FLEXCOM3_IO" index="3"/>
              <signal pad="PB12" function="B" group="FLEXCOM3_IO" index="3"/>
              <signal pad="PA18" function="B" group="FLEXCOM3_IO" index="4"/>
              <signal pad="PB0" function="B" group="FLEXCOM3_IO" index="4"/>
              <signal pad="PB11" function="C" group="FLEXCOM3_IO" index="4"/>
            </signals>
          </instance>
          <instance name="FLEXCOM4">
            <register-group address-space="base" name="FLEXCOM4" name-in-module="FLEXCOM" offset="0x40010000"/>
            <parameters>
              <param name="INSTANCE_ID" value="13"/>
              <param name="CLOCK_ID" value="13"/>
              <param name="USART_FIFO_SIZE" value="8"/>
              <param name="SPI_FIFO_SIZE" value="8"/>
              <param name="TWI_FIFO_SIZE" value="8"/>
            </parameters>
            <signals>
              <signal pad="PB5" function="B" group="FLEXCOM4_IO" index="0"/>
              <signal pad="PB24" function="B" group="FLEXCOM4_IO" index="0"/>
              <signal pad="PB6" function="B" group="FLEXCOM4_IO" index="1"/>
              <signal pad="PB25" function="B" group="FLEXCOM4_IO" index="1"/>
              <signal pad="PB7" function="B" group="FLEXCOM4_IO" index="2"/>
              <signal pad="PB26" function="B" group="FLEXCOM4_IO" index="2"/>
              <signal pad="PB8" function="B" group="FLEXCOM4_IO" index="3"/>
              <signal pad="PC0" function="B" group="FLEXCOM4_IO" index="3"/>
              <signal pad="PB7" function="C" group="FLEXCOM4_IO" index="4"/>
              <signal pad="PB26" function="C" group="FLEXCOM4_IO" index="4"/>
              <signal pad="PC1" function="B" group="FLEXCOM4_IO" index="4"/>
            </signals>
          </instance>
          <instance name="FLEXCOM5">
            <register-group address-space="base" name="FLEXCOM5" name-in-module="FLEXCOM" offset="0x40014000"/>
            <parameters>
              <param name="INSTANCE_ID" value="14"/>
              <param name="CLOCK_ID" value="14"/>
              <param name="USART_FIFO_SIZE" value="8"/>
              <param name="SPI_FIFO_SIZE" value="8"/>
              <param name="TWI_FIFO_SIZE" value="8"/>
            </parameters>
            <signals>
              <signal pad="PA24" function="B" group="FLEXCOM5_IO" index="0"/>
              <signal pad="PB20" function="B" group="FLEXCOM5_IO" index="0"/>
              <signal pad="PC9" function="A" group="FLEXCOM5_IO" index="0"/>
              <signal pad="PA23" function="B" group="FLEXCOM5_IO" index="1"/>
              <signal pad="PB21" function="B" group="FLEXCOM5_IO" index="1"/>
              <signal pad="PC8" function="A" group="FLEXCOM5_IO" index="1"/>
              <signal pad="PA22" function="B" group="FLEXCOM5_IO" index="2"/>
              <signal pad="PB22" function="B" group="FLEXCOM5_IO" index="2"/>
              <signal pad="PC7" function="A" group="FLEXCOM5_IO" index="2"/>
              <signal pad="PA21" function="B" group="FLEXCOM5_IO" index="3"/>
              <signal pad="PB23" function="B" group="FLEXCOM5_IO" index="3"/>
              <signal pad="PC6" function="A" group="FLEXCOM5_IO" index="3"/>
              <signal pad="PA22" function="C" group="FLEXCOM5_IO" index="4"/>
              <signal pad="PB15" function="B" group="FLEXCOM5_IO" index="4"/>
              <signal pad="PB22" function="C" group="FLEXCOM5_IO" index="4"/>
              <signal pad="PC7" function="C" group="FLEXCOM5_IO" index="4"/>
            </signals>
          </instance>
          <instance name="FLEXCOM6">
            <register-group address-space="base" name="FLEXCOM6" name-in-module="FLEXCOM" offset="0x40018000"/>
            <parameters>
              <param name="INSTANCE_ID" value="15"/>
              <param name="CLOCK_ID" value="15"/>
              <param name="USART_FIFO_SIZE" value="8"/>
              <param name="SPI_FIFO_SIZE" value="8"/>
              <param name="TWI_FIFO_SIZE" value="8"/>
            </parameters>
            <signals>
              <signal pad="PA0" function="A" group="FLEXCOM6_IO" index="0"/>
              <signal pad="PA25" function="B" group="FLEXCOM6_IO" index="0"/>
              <signal pad="PC6" function="B" group="FLEXCOM6_IO" index="0"/>
              <signal pad="PC16" function="A" group="FLEXCOM6_IO" index="0"/>
              <signal pad="PA1" function="A" group="FLEXCOM6_IO" index="1"/>
              <signal pad="PA26" function="B" group="FLEXCOM6_IO" index="1"/>
              <signal pad="PC7" function="B" group="FLEXCOM6_IO" index="1"/>
              <signal pad="PC17" function="A" group="FLEXCOM6_IO" index="1"/>
              <signal pad="PA27" function="B" group="FLEXCOM6_IO" index="2"/>
              <signal pad="PC18" function="A" group="FLEXCOM6_IO" index="2"/>
              <signal pad="PA28" function="B" group="FLEXCOM6_IO" index="3"/>
              <signal pad="PC19" function="A" group="FLEXCOM6_IO" index="3"/>
              <signal pad="PA27" function="C" group="FLEXCOM6_IO" index="4"/>
              <signal pad="PB16" function="B" group="FLEXCOM6_IO" index="4"/>
              <signal pad="PC18" function="B" group="FLEXCOM6_IO" index="4"/>
            </signals>
          </instance>
