Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTC/atdf/PIC32CX1025MTC128.atdf
        <register caption="PWM Channel Period Update Register" name="PWM_CPRDUPD" offset="0x10" rw="W" size="4">
          <bitfield caption="Channel Period Update" mask="0x00FFFFFF" name="CPRDUPD"/>
        </register>
        <register caption="PWM Channel Counter Register" name="PWM_CCNT" offset="0x14" rw="R" size="4">
          <bitfield caption="Channel Counter Register" mask="0x00FFFFFF" name="CNT"/>
        </register>
        <register caption="PWM Channel Dead Time Register" name="PWM_DT" offset="0x18" rw="RW" size="4">
          <bitfield caption="Dead-Time Value for PWMHx Output" mask="0x0000FFFF" name="DTH"/>
          <bitfield caption="Dead-Time Value for PWMLx Output" mask="0xFFFF0000" name="DTL"/>
        </register>
        <register caption="PWM Channel Dead Time Update Register" name="PWM_DTUPD" offset="0x1C" rw="W" size="4">
          <bitfield caption="Dead-Time Value Update for PWMHx Output" mask="0x0000FFFF" name="DTHUPD"/>
          <bitfield caption="Dead-Time Value Update for PWMLx Output" mask="0xFFFF0000" name="DTLUPD"/>
        </register>
      </register-group>
      <register-group name="PWM_CMP" size="16">
        <register caption="PWM Comparison 0 Value Register" name="PWM_CMPV" offset="0x0" rw="RW" size="4">
          <bitfield caption="Comparison x Value" mask="0x00FFFFFF" name="CV"/>
          <bitfield caption="Comparison x Value Mode" mask="0x01000000" name="CVM" values="PWM_CMPV__CVM"/>
        </register>
        <register caption="PWM Comparison 0 Value Update Register" name="PWM_CMPVUPD" offset="0x4" rw="W" size="4">
          <bitfield caption="Comparison x Value Update" mask="0x00FFFFFF" name="CVUPD"/>
          <bitfield caption="Comparison x Value Mode Update" mask="0x01000000" name="CVMUPD"/>
        </register>
        <register caption="PWM Comparison 0 Mode Register" name="PWM_CMPM" offset="0x8" rw="RW" size="4">
          <bitfield caption="Comparison x Enable" mask="0x00000001" name="CEN"/>
          <bitfield caption="Comparison x Trigger" mask="0x000000F0" name="CTR"/>
          <bitfield caption="Comparison x Period" mask="0x00000F00" name="CPR"/>
          <bitfield caption="Comparison x Period Counter" mask="0x0000F000" name="CPRCNT"/>
          <bitfield caption="Comparison x Update Period" mask="0x000F0000" name="CUPR"/>
          <bitfield caption="Comparison x Update Period Counter" mask="0x00F00000" name="CUPRCNT"/>
        </register>
        <register caption="PWM Comparison 0 Mode Update Register" name="PWM_CMPMUPD" offset="0xC" rw="W" size="4">
          <bitfield caption="Comparison x Enable Update" mask="0x00000001" name="CENUPD"/>
          <bitfield caption="Comparison x Trigger Update" mask="0x000000F0" name="CTRUPD"/>
          <bitfield caption="Comparison x Period Update" mask="0x00000F00" name="CPRUPD"/>
          <bitfield caption="Comparison x Update Period Update" mask="0x000F0000" name="CUPRUPD"/>
        </register>
      </register-group>
      <register-group name="PWM">
        <register caption="PWM Clock Register" name="PWM_CLK" offset="0x00" rw="RW" size="4">
          <bitfield caption="CLKA Divide Factor" mask="0x000000FF" name="DIVA" values="PWM_CLK__DIVA"/>
          <bitfield caption="CLKA Source Clock Selection" mask="0x00000F00" name="PREA" values="PWM_CLK__PREA"/>
          <bitfield caption="CLKB Divide Factor" mask="0x00FF0000" name="DIVB" values="PWM_CLK__DIVB"/>
          <bitfield caption="CLKB Source Clock Selection" mask="0x0F000000" name="PREB" values="PWM_CLK__PREB"/>
        </register>
        <register caption="PWM Enable Register" name="PWM_ENA" offset="0x04" rw="W" size="4">
          <bitfield caption="Channel ID" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Channel ID" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Channel ID" mask="0x00000004" name="CHID2"/>
        </register>
        <register caption="PWM Disable Register" name="PWM_DIS" offset="0x08" rw="W" size="4">
          <bitfield caption="Channel ID" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Channel ID" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Channel ID" mask="0x00000004" name="CHID2"/>
        </register>
        <register caption="PWM Status Register" name="PWM_SR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Channel ID" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Channel ID" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Channel ID" mask="0x00000004" name="CHID2"/>
        </register>
        <register caption="PWM Interrupt Enable Register 1" name="PWM_IER1" offset="0x10" rw="W" size="4">
          <bitfield caption="Counter Event on Channel 0 Interrupt Enable" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Counter Event on Channel 1 Interrupt Enable" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Counter Event on Channel 2 Interrupt Enable" mask="0x00000004" name="CHID2"/>
          <bitfield caption="Fault Protection Trigger on Channel 0 Interrupt Enable" mask="0x00010000" name="FCHID0"/>
          <bitfield caption="Fault Protection Trigger on Channel 1 Interrupt Enable" mask="0x00020000" name="FCHID1"/>
          <bitfield caption="Fault Protection Trigger on Channel 2 Interrupt Enable" mask="0x00040000" name="FCHID2"/>
        </register>
        <register caption="PWM Interrupt Disable Register 1" name="PWM_IDR1" offset="0x14" rw="W" size="4">
          <bitfield caption="Counter Event on Channel 0 Interrupt Disable" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Counter Event on Channel 1 Interrupt Disable" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Counter Event on Channel 2 Interrupt Disable" mask="0x00000004" name="CHID2"/>
          <bitfield caption="Fault Protection Trigger on Channel 0 Interrupt Disable" mask="0x00010000" name="FCHID0"/>
          <bitfield caption="Fault Protection Trigger on Channel 1 Interrupt Disable" mask="0x00020000" name="FCHID1"/>
          <bitfield caption="Fault Protection Trigger on Channel 2 Interrupt Disable" mask="0x00040000" name="FCHID2"/>
        </register>
        <register caption="PWM Interrupt Mask Register 1" name="PWM_IMR1" offset="0x18" rw="R" size="4">
          <bitfield caption="Counter Event on Channel 0 Interrupt Mask" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Counter Event on Channel 1 Interrupt Mask" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Counter Event on Channel 2 Interrupt Mask" mask="0x00000004" name="CHID2"/>
          <bitfield caption="Fault Protection Trigger on Channel 0 Interrupt Mask" mask="0x00010000" name="FCHID0"/>
          <bitfield caption="Fault Protection Trigger on Channel 1 Interrupt Mask" mask="0x00020000" name="FCHID1"/>
          <bitfield caption="Fault Protection Trigger on Channel 2 Interrupt Mask" mask="0x00040000" name="FCHID2"/>
        </register>
