Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTC/atdf/PIC32CX1025MTC128.atdf
        <register caption="PWM Leading-Edge Blanking Register 1" name="PWM_LEBR1" offset="0x430" rw="RW" size="4">
          <bitfield caption="Leading-Edge Blanking Delay for TRGINx" mask="0x0000007F" name="LEBDELAY"/>
          <bitfield caption="PWML Falling Edge Enable" mask="0x00010000" name="PWMLFEN"/>
          <bitfield caption="PWML Rising Edge Enable" mask="0x00020000" name="PWMLREN"/>
          <bitfield caption="PWMH Falling Edge Enable" mask="0x00040000" name="PWMHFEN"/>
          <bitfield caption="PWMH Rising Edge Enable" mask="0x00080000" name="PWMHREN"/>
        </register>
        <register caption="PWM Channel Mode Update Register (ch_num = 2)" name="PWM_CMUPD2" offset="0x440" rw="W" size="4">
          <bitfield caption="Channel Polarity Update" mask="0x00000200" name="CPOLUP"/>
          <bitfield caption="Channel Polarity Inversion Update" mask="0x00002000" name="CPOLINVUP"/>
        </register>
        <register caption="PWM External Trigger Register 2" name="PWM_ETRG2" offset="0x44C" rw="RW" size="4">
          <bitfield caption="Maximum Counter value" mask="0x00FFFFFF" name="MAXCNT"/>
          <bitfield caption="External Trigger Mode" mask="0x03000000" name="TRGMODE" values="PWM_ETRG2__TRGMODE"/>
          <bitfield caption="Edge Selection" mask="0x10000000" name="TRGEDGE" values="PWM_ETRG2__TRGEDGE"/>
          <bitfield caption="Filtered input" mask="0x20000000" name="TRGFILT"/>
          <bitfield caption="Trigger Source" mask="0x40000000" name="TRGSRC"/>
          <bitfield caption="Recoverable Fault Enable" mask="0x80000000" name="RFEN"/>
        </register>
        <register caption="PWM Leading-Edge Blanking Register 2" name="PWM_LEBR2" offset="0x450" rw="RW" size="4">
          <bitfield caption="Leading-Edge Blanking Delay for TRGINx" mask="0x0000007F" name="LEBDELAY"/>
          <bitfield caption="PWML Falling Edge Enable" mask="0x00010000" name="PWMLFEN"/>
          <bitfield caption="PWML Rising Edge Enable" mask="0x00020000" name="PWMLREN"/>
          <bitfield caption="PWMH Falling Edge Enable" mask="0x00040000" name="PWMHFEN"/>
          <bitfield caption="PWMH Rising Edge Enable" mask="0x00080000" name="PWMHREN"/>
        </register>
      </register-group>
      <value-group caption="Channel Prescaler" name="PWM_CMR__CPRE">
        <value caption="Peripheral clock" name="MCK" value="0x0"/>
        <value caption="Peripheral clock/2" name="MCK_DIV_2" value="0x1"/>
        <value caption="Peripheral clock/4" name="MCK_DIV_4" value="0x2"/>
        <value caption="Peripheral clock/8" name="MCK_DIV_8" value="0x3"/>
        <value caption="Peripheral clock/16" name="MCK_DIV_16" value="0x4"/>
        <value caption="Peripheral clock/32" name="MCK_DIV_32" value="0x5"/>
        <value caption="Peripheral clock/64" name="MCK_DIV_64" value="0x6"/>
        <value caption="Peripheral clock/128" name="MCK_DIV_128" value="0x7"/>
        <value caption="Peripheral clock/256" name="MCK_DIV_256" value="0x8"/>
        <value caption="Peripheral clock/512" name="MCK_DIV_512" value="0x9"/>
        <value caption="Peripheral clock/1024" name="MCK_DIV_1024" value="0xA"/>
        <value caption="Clock A" name="CLKA" value="0xB"/>
        <value caption="Clock B" name="CLKB" value="0xC"/>
      </value-group>
      <value-group caption="Channel Alignment" name="PWM_CMR__CALG">
        <value caption="Left aligned" name="LEFT_ALIGNED" value="0x0"/>
        <value caption="Center aligned" name="CENTER_ALIGNED" value="0x1"/>
      </value-group>
      <value-group caption="Channel Polarity" name="PWM_CMR__CPOL">
        <value caption="Waveform starts at low level" name="LOW_POLARITY" value="0x0"/>
        <value caption="Waveform starts at high level" name="HIGH_POLARITY" value="0x1"/>
      </value-group>
      <value-group caption="Counter Event Selection" name="PWM_CMR__CES">
        <value caption="At the end of PWM period" name="SINGLE_EVENT" value="0x0"/>
        <value caption="At half of PWM period AND at the end of PWM period" name="DOUBLE_EVENT" value="0x1"/>
      </value-group>
      <value-group caption="Update Selection" name="PWM_CMR__UPDS">
        <value caption="At the next end of PWM period" name="UPDATE_AT_PERIOD" value="0x0"/>
        <value caption="At the next end of Half PWM period" name="UPDATE_AT_HALF_PERIOD" value="0x1"/>
      </value-group>
      <value-group caption="CLKA Divide Factor" name="PWM_CLK__DIVA">
        <value caption="CLKA clock is turned off" name="CLKA_POFF" value="0"/>
        <value caption="CLKA clock is clock selected by PREA" name="PREA" value="1"/>
      </value-group>
      <value-group caption="CLKA Source Clock Selection" name="PWM_CLK__PREA">
        <value caption="Peripheral clock" name="CLK" value="0x0"/>
        <value caption="Peripheral clock/2" name="CLK_DIV2" value="0x1"/>
        <value caption="Peripheral clock/4" name="CLK_DIV4" value="0x2"/>
        <value caption="Peripheral clock/8" name="CLK_DIV8" value="0x3"/>
        <value caption="Peripheral clock/16" name="CLK_DIV16" value="0x4"/>
        <value caption="Peripheral clock/32" name="CLK_DIV32" value="0x5"/>
        <value caption="Peripheral clock/64" name="CLK_DIV64" value="0x6"/>
        <value caption="Peripheral clock/128" name="CLK_DIV128" value="0x7"/>
        <value caption="Peripheral clock/256" name="CLK_DIV256" value="0x8"/>
        <value caption="Peripheral clock/512" name="CLK_DIV512" value="0x9"/>
        <value caption="Peripheral clock/1024" name="CLK_DIV1024" value="0xA"/>
      </value-group>
      <value-group caption="CLKB Divide Factor" name="PWM_CLK__DIVB">
        <value caption="CLKB clock is turned off" name="CLKB_POFF" value="0"/>
        <value caption="CLKB clock is clock selected by PREB" name="PREB" value="1"/>
      </value-group>
      <value-group caption="CLKB Source Clock Selection" name="PWM_CLK__PREB">
        <value caption="Peripheral clock" name="CLK" value="0x0"/>
        <value caption="Peripheral clock/2" name="CLK_DIV2" value="0x1"/>
        <value caption="Peripheral clock/4" name="CLK_DIV4" value="0x2"/>
        <value caption="Peripheral clock/8" name="CLK_DIV8" value="0x3"/>
        <value caption="Peripheral clock/16" name="CLK_DIV16" value="0x4"/>
        <value caption="Peripheral clock/32" name="CLK_DIV32" value="0x5"/>
        <value caption="Peripheral clock/64" name="CLK_DIV64" value="0x6"/>
        <value caption="Peripheral clock/128" name="CLK_DIV128" value="0x7"/>
        <value caption="Peripheral clock/256" name="CLK_DIV256" value="0x8"/>
        <value caption="Peripheral clock/512" name="CLK_DIV512" value="0x9"/>
        <value caption="Peripheral clock/1024" name="CLK_DIV1024" value="0xA"/>
      </value-group>
      <value-group caption="Synchronous Channels Update Mode" name="PWM_SCM__UPDM">
        <value caption="Manual write of double buffer registers and manual update of synchronous channels" name="MODE0" value="0x0"/>
        <value caption="Manual write of double buffer registers and automatic update of synchronous channels" name="MODE1" value="0x1"/>
        <value caption="Automatic write of duty-cycle update registers by the Peripheral DMA Controller and automatic update of synchronous channels" name="MODE2" value="0x2"/>
      </value-group>
      <value-group caption="PWM Output Mode when System is in Debug Mode" name="PWM_DEBUG__OUTMODE">
        <value caption="Keeps the PWM outputs running when the processor reports a debug operating mode." name="NO_EFFECT" value="0"/>
      </value-group>
      <value-group caption="Write Protection Command" name="PWM_WPCR__WPCMD">
        <value caption="Disables the software write protection of the register groups of which the bit WPRGx is at '1'." name="DISABLE_SW_PROT" value="0x0"/>
        <value caption="Enables the software write protection of the register groups of which the bit WPRGx is at '1'." name="ENABLE_SW_PROT" value="0x1"/>
        <value caption="Enables the hardware write protection of the register groups of which the bit WPRGx is at '1'. Only a hardware reset of the PWM controller can disable the hardware write protection. Moreover, to meet security requirements, the PIO lines associated with the PWM can not be configured through the PIO interface." name="ENABLE_HW_PROT" value="0x2"/>
      </value-group>
      <value-group caption="Write Protection Key" name="PWM_WPCR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPCMD field. Always reads as 0" name="PASSWD" value="0x50574D"/>
      </value-group>
      <value-group caption="Write Protection Key" name="PWM_PWPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation. Always reads as 0." name="PASSWD" value="0x504443"/>
      </value-group>
      <value-group caption="External Trigger Mode" name="PWM_ETRG1__TRGMODE">
        <value caption="External trigger is not enabled." name="OFF" value="0x0"/>
        <value caption="External PWM Reset Mode" name="MODE1" value="0x1"/>
        <value caption="External PWM Start Mode" name="MODE2" value="0x2"/>
        <value caption="Cycle-by-cycle Duty Mode" name="MODE3" value="0x3"/>
      </value-group>
      <value-group caption="Edge Selection" name="PWM_ETRG1__TRGEDGE">
        <value caption="TRGMODE = 1: TRGINx event detection on falling edge. TRGMODE = 2, 3: TRGINx active level is 0" name="FALLING_ZERO" value="0"/>
        <value caption="TRGMODE = 1: TRGINx event detection on rising edge. TRGMODE = 2, 3: TRGINx active level is 1" name="RISING_ONE" value="1"/>
      </value-group>
      <value-group caption="External Trigger Mode" name="PWM_ETRG2__TRGMODE">
        <value caption="External trigger is not enabled." name="OFF" value="0x0"/>
        <value caption="External PWM Reset Mode" name="MODE1" value="0x1"/>
        <value caption="External PWM Start Mode" name="MODE2" value="0x2"/>
        <value caption="Cycle-by-cycle Duty Mode" name="MODE3" value="0x3"/>
      </value-group>
      <value-group caption="Edge Selection" name="PWM_ETRG2__TRGEDGE">
        <value caption="TRGMODE = 1: TRGINx event detection on falling edge. TRGMODE = 2, 3: TRGINx active level is 0" name="FALLING_ZERO" value="0"/>
        <value caption="TRGMODE = 1: TRGINx event detection on rising edge. TRGMODE = 2, 3: TRGINx active level is 1" name="RISING_ONE" value="1"/>
      </value-group>
      <value-group caption="" name="PWM_CMPV__CVM">
        <value caption="Compare when counter is incrementing" name="COMPARE_AT_INCREMENT" value="0x0"/>
        <value caption="Compare when counter is decrementing" name="COMPARE_AT_DECREMENT" value="0x1"/>
      </value-group>
    </module>
