Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTC/atdf/PIC32CX1025MTC128.atdf
        <register caption="Write Protection Mode Register" name="SLCDC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Interrupt Enable" mask="0x00000002" name="WPITEN"/>
          <bitfield caption="Write Protection Control Enable" mask="0x00000004" name="WPCREN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="SLCDC_WPMR__WPKEY"/>
        </register>
        <register caption="LSB Memory Register (com = 0)" name="SLCDC_LMEMR0" offset="0x200" rw="RW" size="4">
          <bitfield caption="LSB Pixels Pattern Associated to COMx Terminal" mask="0xFFFFFFFF" name="LPIXEL"/>
        </register>
        <register caption="LSB Memory Register (com = 1)" name="SLCDC_LMEMR1" offset="0x208" rw="RW" size="4">
          <bitfield caption="LSB Pixels Pattern Associated to COMx Terminal" mask="0xFFFFFFFF" name="LPIXEL"/>
        </register>
        <register caption="LSB Memory Register (com = 2)" name="SLCDC_LMEMR2" offset="0x210" rw="RW" size="4">
          <bitfield caption="LSB Pixels Pattern Associated to COMx Terminal" mask="0xFFFFFFFF" name="LPIXEL"/>
        </register>
        <register caption="LSB Memory Register (com = 3)" name="SLCDC_LMEMR3" offset="0x218" rw="RW" size="4">
          <bitfield caption="LSB Pixels Pattern Associated to COMx Terminal" mask="0xFFFFFFFF" name="LPIXEL"/>
        </register>
        <register caption="LSB Memory Register (com = 4)" name="SLCDC_LMEMR4" offset="0x220" rw="RW" size="4">
          <bitfield caption="LSB Pixels Pattern Associated to COMx Terminal" mask="0xFFFFFFFF" name="LPIXEL"/>
        </register>
        <register caption="LSB Memory Register (com = 5)" name="SLCDC_LMEMR5" offset="0x228" rw="RW" size="4">
          <bitfield caption="LSB Pixels Pattern Associated to COMx Terminal" mask="0xFFFFFFFF" name="LPIXEL"/>
        </register>
        <register caption="LSB Memory Register (com = 6)" name="SLCDC_LMEMR6" offset="0x230" rw="RW" size="4">
          <bitfield caption="LSB Pixels Pattern Associated to COMx Terminal" mask="0xFFFFFFFF" name="LPIXEL"/>
        </register>
        <register caption="LSB Memory Register (com = 7)" name="SLCDC_LMEMR7" offset="0x238" rw="RW" size="4">
          <bitfield caption="LSB Pixels Pattern Associated to COMx Terminal" mask="0xFFFFFFFF" name="LPIXEL"/>
        </register>
      </register-group>
      <value-group caption="Freeze Key (write-only)" name="SLCDC_CR__FRZKEY">
        <value caption="Writing any other value in this field aborts the write operation of the FRZDF bit or FRZMAP bit. Always reads as 0." name="PASSWD" value="0x4E"/>
      </value-group>
      <value-group caption="Selection of the Number of Commons" name="SLCDC_MR__COMSEL">
        <value caption="COM0 is driven by SLCDC, COM1:7 are driven by digital function" name="COM_0" value="0x0"/>
        <value caption="COM0:1 are driven by SLCDC, COM2:7 are driven by digital function" name="COM_0TO1" value="0x1"/>
        <value caption="COM0:2 are driven by SLCDC, COM3:7 are driven by digital function" name="COM_0TO2" value="0x2"/>
        <value caption="COM0:3 are driven by SLCDC, COM4:7 are driven by digital function" name="COM_0TO3" value="0x3"/>
        <value caption="COM0:4 are driven by SLCDC, COM5:7 are driven by digital function" name="COM_0TO4" value="0x4"/>
        <value caption="COM0:5 are driven by SLCDC, COM6:7 are driven by digital function" name="COM_0TO5" value="0x5"/>
        <value caption="COM0:6 are driven by SLCDC, COM7 driven by digital function" name="COM_0TO6" value="0x6"/>
        <value caption="COM0:7 are driven by SLCDC, no COM pin driven by digital function" name="COM_0TO7" value="0x7"/>
      </value-group>
      <value-group caption="Buffer On-Time" name="SLCDC_MR__BUFTIME">
        <value caption="Nominal drive time is 0% of SLCK period" name="OFF" value="0x0"/>
        <value caption="Nominal drive time is 2 periods of SLCK clock" name="X2_SLCK_PERIOD" value="0x1"/>
        <value caption="Nominal drive time is 4 periods of SLCK clock" name="X4_SLCK_PERIOD" value="0x2"/>
        <value caption="Nominal drive time is 8 periods of SLCK clock" name="X8_SLCK_PERIOD" value="0x3"/>
        <value caption="Nominal drive time is 16 periods of SLCK clock" name="X16_SLCK_PERIOD" value="0x4"/>
        <value caption="Nominal drive time is 32 periods of SLCK clock" name="X32_SLCK_PERIOD" value="0x5"/>
        <value caption="Nominal drive time is 64 periods of SLCK clock" name="X64_SLCK_PERIOD" value="0x6"/>
        <value caption="Nominal drive time is 128 periods of SLCK clock" name="X128_SLCK_PERIOD" value="0x7"/>
        <value caption="Nominal drive time is 50% of SLCK period" name="PERCENT_50" value="0x8"/>
        <value caption="Nominal drive time is 100% of SLCK period" name="PERCENT_100" value="0x9"/>
      </value-group>
      <value-group caption="LCD Display Configuration" name="SLCDC_MR__BIAS">
        <value caption="Static" name="STATIC" value="0x0"/>
        <value caption="Bias 1/2" name="BIAS_1_2" value="0x1"/>
        <value caption="Bias 1/3" name="BIAS_1_3" value="0x2"/>
        <value caption="Bias 1/4" name="BIAS_1_4" value="0x3"/>
      </value-group>
      <value-group caption="Clock Prescaler" name="SLCDC_FRR__PRESC">
        <value caption="Slow clock is divided by 8" name="SLCK_DIV8" value="0x0"/>
        <value caption="Slow clock is divided by 16" name="SLCK_DIV16" value="0x1"/>
        <value caption="Slow clock is divided by 32" name="SLCK_DIV32" value="0x2"/>
        <value caption="Slow clock is divided by 64" name="SLCK_DIV64" value="0x3"/>
        <value caption="Slow clock is divided by 128" name="SLCK_DIV128" value="0x4"/>
        <value caption="Slow clock is divided by 256" name="SLCK_DIV256" value="0x5"/>
        <value caption="Slow clock is divided by 512" name="SLCK_DIV512" value="0x6"/>
        <value caption="Slow clock is divided by 1024" name="SLCK_DIV1024" value="0x7"/>
      </value-group>
