Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTC/atdf/PIC32CX1025MTC128.atdf
      <value-group caption="Clock Division" name="SLCDC_FRR__DIV">
        <value caption="Clock output from prescaler is divided by 1" name="PRESC_CLK_DIV1" value="0x0"/>
        <value caption="Clock output from prescaler is divided by 2" name="PRESC_CLK_DIV2" value="0x1"/>
        <value caption="Clock output from prescaler is divided by 3" name="PRESC_CLK_DIV3" value="0x2"/>
        <value caption="Clock output from prescaler is divided by 4" name="PRESC_CLK_DIV4" value="0x3"/>
        <value caption="Clock output from prescaler is divided by 5" name="PRESC_CLK_DIV5" value="0x4"/>
        <value caption="Clock output from prescaler is divided by 6" name="PRESC_CLK_DIV6" value="0x5"/>
        <value caption="Clock output from prescaler is divided by 7" name="PRESC_CLK_DIV7" value="0x6"/>
        <value caption="Clock output from prescaler is divided by 8" name="PRESC_CLK_DIV8" value="0x7"/>
      </value-group>
      <value-group caption="Display Mode Register" name="SLCDC_DR__DISPMODE">
        <value caption="Normal Mode-Latched data are displayed." name="NORMAL" value="0x0"/>
        <value caption="Force Off Mode-All pixels are invisible. (The SLCDC memory is unchanged.)" name="FORCE_OFF" value="0x1"/>
        <value caption="Force On Mode-All pixels are visible. (The SLCDC memory is unchanged.)" name="FORCE_ON" value="0x2"/>
        <value caption="Blinking Mode-All pixels are alternately turned off to the predefined state in SLCDC memory at LCDBLKFREQ frequency. (The SLCDC memory is unchanged.)" name="BLINKING" value="0x3"/>
        <value caption="Inverted Mode-All pixels are set in the inverted state as defined in SLCDC memory. (The SLCDC memory is unchanged.)" name="INVERTED" value="0x4"/>
        <value caption="Inverted Blinking Mode-All pixels are alternately turned off to the predefined opposite state in SLCDC memory at LCDBLKFREQ frequency. (The SLCDC memory is unchanged.)" name="INVERTED_BLINK" value="0x5"/>
        <value caption="User Buffer Only Load Mode-Blocks the automatic transfer from User Buffer to Display Buffer." name="USER_BUFFER_LOAD" value="0x6"/>
        <value caption="Buffer Swap Mode-All pixels are alternatively assigned to the state defined in the User Buffer, then to the state defined in the Display Buffer at LCDBLKFREQ frequency." name="BUFFERS_SWAP" value="0x7"/>
      </value-group>
      <value-group caption="Write Protection Key" name="SLCDC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x534C43"/>
      </value-group>
    </module>
    <module caption="Supply Controller" name="SUPC" id="04670" version="E">
      <register-group name="SUPC">
        <register caption="Control Register" name="SUPC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Shutdown" mask="0x00000001" name="SHDW"/>
          <bitfield caption="Shutdown End Of Frame" mask="0x00000002" name="SHDWEOF"/>
          <bitfield caption="Voltage Regulator Off" mask="0x00000004" name="VROFF" values="SUPC_CR__VROFF"/>
          <bitfield caption="Timing Domain Slow Clock Selector" mask="0x00000008" name="TDXTALSEL" values="SUPC_CR__TDXTALSEL"/>
          <bitfield caption="Password" mask="0xFF000000" name="KEY" values="SUPC_CR__KEY"/>
        </register>
        <register caption="Supply Monitor Mode Register" name="SUPC_SMMR" offset="0x04" rw="RW" size="4">
          <bitfield caption="VDD3V3 Supply Monitor Threshold" mask="0x0000000F" name="VDD3V3SMTH"/>
          <bitfield caption="VDD3V3 Supply Monitor Sampling Period" mask="0x00000700" name="VDD3V3SMSMPL" values="SUPC_SMMR__VDD3V3SMSMPL"/>
          <bitfield caption="VDD3V3 Supply Monitor Reset Enable" mask="0x00001000" name="VDD3V3SMRSTEN"/>
          <bitfield caption="VDD3V3 Supply Monitor Power Supply Mode" mask="0x00002000" name="VDD3V3SMPWRM" values="SUPC_SMMR__VDD3V3SMPWRM"/>
        </register>
        <register caption="Mode Register" name="SUPC_MR" offset="0x08" rw="RW" size="4">
          <bitfield caption="LCD Voltage Regulator Output" mask="0x0000000F" name="LCDOUT"/>
          <bitfield caption="LCD Controller Mode of Operation" mask="0x00000030" name="LCDMODE" values="SUPC_MR__LCDMODE"/>
          <bitfield caption="VDDCORE Supply Monitor Output Mode" mask="0x00000040" name="CORSMM" values="SUPC_MR__CORSMM"/>
          <bitfield caption="Internal VDDCORE Voltage Regulator Disable" mask="0x00000080" name="VREGDIS" values="SUPC_MR__VREGDIS"/>
          <bitfield caption="VDDCORE Supply Monitor Reset Enable" mask="0x00001000" name="CORSMRSTEN"/>
          <bitfield caption="VDDCORE Supply Monitor Disable" mask="0x00002000" name="CORSMDIS"/>
          <bitfield caption="Backup Domain IO Isolation Control" mask="0x00004000" name="IO_BACKUP_ISO"/>
          <bitfield caption="Slow Crystal Oscillator Bypass" mask="0x00100000" name="OSCBYPASS" values="SUPC_MR__OSCBYPASS"/>
          <bitfield caption="Password Key" mask="0xFF000000" name="KEY" values="SUPC_MR__KEY"/>
        </register>
        <register caption="Wakeup Mode Register" name="SUPC_WUMR" offset="0x0C" rw="RW" size="4">
          <bitfield caption="Tamper Enable for WKUPx Pin" mask="0x00000001" name="LPDBCEN0"/>
          <bitfield caption="Tamper Enable for WKUPx Pin" mask="0x00000002" name="LPDBCEN1"/>
          <bitfield caption="Tamper Enable for WKUPx Pin" mask="0x00000004" name="LPDBCEN2"/>
          <bitfield caption="Tamper Enable for WKUPx Pin" mask="0x00000008" name="LPDBCEN3"/>
          <bitfield caption="Tamper Enable for WKUPx Pin" mask="0x00000010" name="LPDBCEN4"/>
          <bitfield caption="Force Wake-up Inputs Debouncer Period" mask="0x00000700" name="FWUPDBC" values="SUPC_WUMR__FWUPDBC"/>
          <bitfield caption="Wake-up Inputs Debouncer Period" mask="0x00007000" name="WKUPDBC" values="SUPC_WUMR__WKUPDBC"/>
          <bitfield caption="Low-power Debouncer Period of WKUPx" mask="0x00070000" name="LPDBC0" values="SUPC_WUMR__LPDBC0"/>
          <bitfield caption="Low-power Debouncer Period of WKUPx" mask="0x00380000" name="LPDBC1" values="SUPC_WUMR__LPDBC1"/>
          <bitfield caption="Low-power Debouncer Period of WKUPx" mask="0x01C00000" name="LPDBC2" values="SUPC_WUMR__LPDBC2"/>
          <bitfield caption="Low-power Debouncer Period of WKUPx" mask="0x0E000000" name="LPDBC3" values="SUPC_WUMR__LPDBC3"/>
          <bitfield caption="Low-power Debouncer Period of WKUPx" mask="0x70000000" name="LPDBC4" values="SUPC_WUMR__LPDBC4"/>
        </register>
        <register caption="Wakeup Inputs Register" name="SUPC_WUIR" offset="0x10" rw="RW" size="4">
          <bitfield caption="Wake-up Input Enable 0" mask="0x00000001" name="WKUPEN0"/>
          <bitfield caption="Wake-up Input Enable 1" mask="0x00000002" name="WKUPEN1"/>
          <bitfield caption="Wake-up Input Enable 2" mask="0x00000004" name="WKUPEN2"/>
          <bitfield caption="Wake-up Input Enable 3" mask="0x00000008" name="WKUPEN3"/>
          <bitfield caption="Wake-up Input Enable 4" mask="0x00000010" name="WKUPEN4"/>
          <bitfield caption="Wake-up Input Enable 5" mask="0x00000020" name="WKUPEN5"/>
          <bitfield caption="Wake-up Input Enable 6" mask="0x00000040" name="WKUPEN6"/>
          <bitfield caption="Wake-up Input Enable 7" mask="0x00000080" name="WKUPEN7"/>
          <bitfield caption="Wake-up Input Enable 8" mask="0x00000100" name="WKUPEN8"/>
          <bitfield caption="Wake-up Input Enable 9" mask="0x00000200" name="WKUPEN9"/>
          <bitfield caption="Wake-up Input Enable 10" mask="0x00000400" name="WKUPEN10"/>
          <bitfield caption="Wake-up Input Enable 11" mask="0x00000800" name="WKUPEN11"/>
          <bitfield caption="Wake-up Input Enable 12" mask="0x00001000" name="WKUPEN12"/>
          <bitfield caption="Wake-up Input Enable 13" mask="0x00002000" name="WKUPEN13"/>
          <bitfield caption="Wake-up Input Enable 14" mask="0x00004000" name="WKUPEN14"/>
          <bitfield caption="Wake-up Input Type 0" mask="0x00010000" name="WKUPT0" values="SUPC_WUIR__WKUPT0"/>
          <bitfield caption="Wake-up Input Type 1" mask="0x00020000" name="WKUPT1" values="SUPC_WUIR__WKUPT1"/>
          <bitfield caption="Wake-up Input Type 2" mask="0x00040000" name="WKUPT2" values="SUPC_WUIR__WKUPT2"/>
          <bitfield caption="Wake-up Input Type 3" mask="0x00080000" name="WKUPT3" values="SUPC_WUIR__WKUPT3"/>
          <bitfield caption="Wake-up Input Type 4" mask="0x00100000" name="WKUPT4" values="SUPC_WUIR__WKUPT4"/>
          <bitfield caption="Wake-up Input Type 5" mask="0x00200000" name="WKUPT5" values="SUPC_WUIR__WKUPT5"/>
          <bitfield caption="Wake-up Input Type 6" mask="0x00400000" name="WKUPT6" values="SUPC_WUIR__WKUPT6"/>
          <bitfield caption="Wake-up Input Type 7" mask="0x00800000" name="WKUPT7" values="SUPC_WUIR__WKUPT7"/>
          <bitfield caption="Wake-up Input Type 8" mask="0x01000000" name="WKUPT8" values="SUPC_WUIR__WKUPT8"/>
          <bitfield caption="Wake-up Input Type 9" mask="0x02000000" name="WKUPT9" values="SUPC_WUIR__WKUPT9"/>
          <bitfield caption="Wake-up Input Type 10" mask="0x04000000" name="WKUPT10" values="SUPC_WUIR__WKUPT10"/>
          <bitfield caption="Wake-up Input Type 11" mask="0x08000000" name="WKUPT11" values="SUPC_WUIR__WKUPT11"/>
          <bitfield caption="Wake-up Input Type 12" mask="0x10000000" name="WKUPT12" values="SUPC_WUIR__WKUPT12"/>
          <bitfield caption="Wake-up Input Type 13" mask="0x20000000" name="WKUPT13" values="SUPC_WUIR__WKUPT13"/>
          <bitfield caption="Wake-up Input Type 14" mask="0x40000000" name="WKUPT14" values="SUPC_WUIR__WKUPT14"/>
        </register>
        <register caption="Status Register" name="SUPC_SR" offset="0x14" rw="R" size="4">
          <bitfield caption="Timing Domain 32 kHz Oscillator Selection Status" mask="0x00000001" name="TDOSCSEL" values="SUPC_SR__TDOSCSEL"/>
          <bitfield caption="VDD3V3 Supply Monitor Wake-up Status (cleared by reading SUPC_WUSR)" mask="0x00000004" name="VDD3V3SMWS"/>
          <bitfield caption="VDDCORE Supply Monitor Reset Status (cleared by reading SUPC_WUSR)" mask="0x00000008" name="CORSMRSTS"/>
          <bitfield caption="VDD3V3 Supply Monitor Reset Status (cleared by reading SUPC_WUSR)" mask="0x00000010" name="VDD3V3SMRSTS"/>
          <bitfield caption="VDD3V3 Supply Monitor Interrupt Status (cleared by reading SUPC_ISR)" mask="0x00000020" name="VDD3V3SMIS"/>
          <bitfield caption="VDD3V3 Supply Monitor Output Status" mask="0x00000040" name="VDD3V3SMS"/>
          <bitfield caption="LCD Power Domain Status" mask="0x00000100" name="LCDS"/>
          <bitfield caption="Force Wake-up Pin Status" mask="0x00001000" name="FWUPS"/>
          <bitfield caption="Tamper Detection Wake-up Status (cleared by reading SUPC_ISR)" mask="0x00010000" name="LPDBCS0"/>
          <bitfield caption="Tamper Detection Wake-up Status (cleared by reading SUPC_ISR)" mask="0x00020000" name="LPDBCS1"/>
          <bitfield caption="Tamper Detection Wake-up Status (cleared by reading SUPC_ISR)" mask="0x00040000" name="LPDBCS2"/>
          <bitfield caption="Tamper Detection Wake-up Status (cleared by reading SUPC_ISR)" mask="0x00080000" name="LPDBCS3"/>
          <bitfield caption="Tamper Detection Wake-up Status (cleared by reading SUPC_ISR)" mask="0x00100000" name="LPDBCS4"/>
          <bitfield caption="Slow Crystal Oscillator Frequency Monitor Status (cleared on read)" mask="0x03000000" name="SXFMS" values="SUPC_SR__SXFMS"/>
          <bitfield caption="Slow Crystal Oscillator Frequency Monitor Error (cleared on read)" mask="0x04000000" name="SXFME"/>
          <bitfield caption="WKUP Wake-up Status (cleared by reading SUPC_WUSR)" mask="0x08000000" name="WKUPS"/>
          <bitfield caption="Slow Crystal Oscillator Wake-up Status (cleared by reading SUPC_WUSR)" mask="0x10000000" name="BADXTS"/>
          <bitfield caption="FWUP Wake-up Status (cleared by reading SUPC_WUSR)" mask="0x20000000" name="FWKUPS"/>
          <bitfield caption="RTT Wake-up Status (cleared by reading SUPC_WUSR)" mask="0x40000000" name="RTTS"/>
          <bitfield caption="RTC Wake-up Status (cleared by reading SUPC_WUSR)" mask="0x80000000" name="RTCS"/>
        </register>
