Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTC/atdf/PIC32CX1025MTC128.atdf
        <register caption="Extended Mode Register" name="TC_EMR" offset="0x30" rw="RW" size="4">
          <bitfield caption="Trigger Source for Input A" mask="0x00000003" name="TRIGSRCA" values="TC_EMR0__TRIGSRCA"/>
          <bitfield caption="Trigger Source for Input B" mask="0x00000030" name="TRIGSRCB" values="TC_EMR0__TRIGSRCB"/>
          <bitfield caption="No Divided Clock" mask="0x00000100" name="NODIVCLK"/>
        </register>
        <register caption="Channel Status Register" name="TC_CSR" offset="0x34" rw="R" size="4">
          <bitfield caption="Clock Enabling Status" mask="0x00010000" name="CLKSTA"/>
          <bitfield caption="TIOAx Mirror" mask="0x00020000" name="MTIOA"/>
          <bitfield caption="TIOBx Mirror" mask="0x00040000" name="MTIOB"/>
        </register>
        <register caption="Safety Status Register" name="TC_SSR" offset="0x38" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status (cleared on read)" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Clock Glitch Detected (cleared on read)" mask="0x00000002" name="CGD"/>
          <bitfield caption="Internal Sequencer Error (cleared on read)" mask="0x00000004" name="SEQE"/>
          <bitfield caption="Software Control Error (cleared on read)" mask="0x00000008" name="SWE"/>
          <bitfield caption="Write Protection Violation Source (cleared on read)" mask="0x00FFFF00" name="WPVSRC"/>
          <bitfield caption="Software Error Type (cleared on read)" mask="0x0F000000" name="SWETYP" values="TC_SSR0__SWETYP"/>
          <bitfield caption="Software Error Class" mask="0x80000000" name="ECLASS" values="TC_SSR0__ECLASS"/>
        </register>
      </register-group>
      <register-group name="TC">
        <register-group name="TC_CHANNEL" size="64" name-in-module="TC_CHANNEL" offset="0x0" count="3"/>
        <register caption="Block Control Register" name="TC_BCR" offset="0xC0" rw="W" size="4">
          <bitfield caption="Synchro Command" mask="0x00000001" name="SYNC"/>
        </register>
        <register caption="Block Mode Register" name="TC_BMR" offset="0xC4" rw="RW" size="4">
          <bitfield caption="External Clock Signal 0 Selection" mask="0x00000003" name="TC0XC0S" values="TC_BMR__TC0XC0S"/>
          <bitfield caption="External Clock Signal 1 Selection" mask="0x0000000C" name="TC1XC1S" values="TC_BMR__TC1XC1S"/>
          <bitfield caption="External Clock Signal 2 Selection" mask="0x00000030" name="TC2XC2S" values="TC_BMR__TC2XC2S"/>
          <bitfield caption="Quadrature Decoder Enabled" mask="0x00000100" name="QDEN"/>
          <bitfield caption="Position Enabled" mask="0x00000200" name="POSEN"/>
          <bitfield caption="Speed Enabled" mask="0x00000400" name="SPEEDEN"/>
          <bitfield caption="Quadrature Decoding Transparent" mask="0x00000800" name="QDTRANS"/>
          <bitfield caption="Edge on PHA Count Mode" mask="0x00001000" name="EDGPHA"/>
          <bitfield caption="Inverted PHA" mask="0x00002000" name="INVA"/>
          <bitfield caption="Inverted PHB" mask="0x00004000" name="INVB"/>
          <bitfield caption="Inverted Index" mask="0x00008000" name="INVIDX"/>
          <bitfield caption="Swap PHA and PHB" mask="0x00010000" name="SWAP"/>
          <bitfield caption="Index Pin is PHB Pin" mask="0x00020000" name="IDXPHB"/>
          <bitfield caption="Maximum Filter" mask="0x03F00000" name="MAXFILT"/>
        </register>
        <register caption="QDEC Interrupt Enable Register" name="TC_QIER" offset="0xC8" rw="W" size="4">
          <bitfield caption="Index" mask="0x00000001" name="IDX"/>
          <bitfield caption="Direction Change" mask="0x00000002" name="DIRCHG"/>
          <bitfield caption="Quadrature Error" mask="0x00000004" name="QERR"/>
          <bitfield caption="Filtered Phase A Line" mask="0x00000010" name="FPHA"/>
          <bitfield caption="Filtered Phase B Line" mask="0x00000020" name="FPHB"/>
          <bitfield caption="Filtered Index Line" mask="0x00000040" name="FIDX"/>
          <bitfield caption="Filtered Missing Pulse" mask="0x00000080" name="FMP"/>
        </register>
        <register caption="QDEC Interrupt Disable Register" name="TC_QIDR" offset="0xCC" rw="W" size="4">
          <bitfield caption="Index" mask="0x00000001" name="IDX"/>
          <bitfield caption="Direction Change" mask="0x00000002" name="DIRCHG"/>
          <bitfield caption="Quadrature Error" mask="0x00000004" name="QERR"/>
          <bitfield caption="Filtered Phase A Line" mask="0x00000010" name="FPHA"/>
          <bitfield caption="Filtered Phase B Line" mask="0x00000020" name="FPHB"/>
          <bitfield caption="Filtered Index Line" mask="0x00000040" name="FIDX"/>
          <bitfield caption="Filtered Missing Pulse" mask="0x00000080" name="FMP"/>
        </register>
        <register caption="QDEC Interrupt Mask Register" name="TC_QIMR" offset="0xD0" rw="R" size="4">
          <bitfield caption="Index" mask="0x00000001" name="IDX"/>
          <bitfield caption="Direction Change" mask="0x00000002" name="DIRCHG"/>
          <bitfield caption="Quadrature Error" mask="0x00000004" name="QERR"/>
          <bitfield caption="Filtered Phase A Line" mask="0x00000010" name="FPHA"/>
          <bitfield caption="Filtered Phase B Line" mask="0x00000020" name="FPHB"/>
          <bitfield caption="Filtered Index Line" mask="0x00000040" name="FIDX"/>
          <bitfield caption="Filtered Missing Pulse" mask="0x00000080" name="FMP"/>
        </register>
        <register caption="QDEC Interrupt Status Register" name="TC_QISR" offset="0xD4" rw="R" size="4">
          <bitfield caption="Index" mask="0x00000001" name="IDX"/>
          <bitfield caption="Direction Change" mask="0x00000002" name="DIRCHG"/>
          <bitfield caption="Quadrature Error" mask="0x00000004" name="QERR"/>
          <bitfield caption="Filtered Phase A Line" mask="0x00000010" name="FPHA"/>
          <bitfield caption="Filtered Phase B Line" mask="0x00000020" name="FPHB"/>
          <bitfield caption="Filtered Index Line" mask="0x00000040" name="FIDX"/>
          <bitfield caption="Filtered Missing Pulse" mask="0x00000080" name="FMP"/>
          <bitfield caption="Direction" mask="0x00000100" name="DIR"/>
        </register>
